In [1]:
# 22 Aug 2022

In [1]:
import pandas as pd

In [2]:
# Series
'''One-dimensional ndarray with axis labels (including time series).'''

'One-dimensional ndarray with axis labels (including time series).'

In [3]:
x=pd.Series([1,2,3,4,5])
x

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
x1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
x1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
x1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'],dtype=float)
x1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

In [6]:
x2=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
x2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
x3=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['f','g','h','i','j'])
x3

f   NaN
g   NaN
h   NaN
i   NaN
j   NaN
dtype: float64

In [8]:
x3=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['f','g','h','i','j','a','d'])
x3

f    NaN
g    NaN
h    NaN
i    NaN
j    NaN
a    1.0
d    4.0
dtype: float64

In [9]:
# Giving column label to a series

In [10]:
x3=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['f','g','h','i','j','a','d'])
x3=pd.DataFrame(x3,columns =['Numbers'])
x3

   Numbers
f      NaN
g      NaN
h      NaN
i      NaN
j      NaN
a      1.0
d      4.0

In [3]:
import numpy as np

In [12]:
x4=pd.Series(np.array([1,2,3,4,5]))
x4

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [13]:
x5=pd.Series([1,2,3,4,5],index=range(len([1,2,3,4,5])))
x5

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
# we cant use Set in series

In [15]:
x=pd.Series({1,2,3,4})

TypeError: 'set' type is unordered

In [4]:
x=pd.Series([1,2,3,4],index=["a","b","c"],dtype=np.int8)

ValueError: Length of values (4) does not match length of index (3)

In [12]:
x=pd.Series([1,2,3,4],index=["a","b","c",'d','e'],dtype=np.int8)

ValueError: Length of values (4) does not match length of index (5)

In [5]:
x=pd.Series({"a":1,"b":2,"c":3},index=["b","c"])
x

b    2
c    3
dtype: int64

In [ ]:
#indexing

In [6]:
x=pd.Series([1,2,3,4])
x[0]

1

In [7]:
x[1]

2

In [8]:
x[:]

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
# We cant use '-ve' indexing in Series

In [17]:
x[-1]

KeyError: -1

In [9]:
x=np.array([2,3,4])
x[-1]

4

In [18]:
x=pd.Series([1,2,3,4])
x

0    1
1    2
2    3
3    4
dtype: int64

In [19]:
# Slicing

In [10]:
x=pd.Series([1,2,3,4])
x[1:3]

1    2
2    3
dtype: int64

In [11]:
x=pd.Series([1,2,3,4],index=["a","b","c","d"])
x

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
x[0]

1

In [23]:
x["a"]

1

In [24]:
x["c"]

3

In [25]:
x["a":"c"]

a    1
b    2
c    3
dtype: int64

In [26]:
x[0:2]

a    1
b    2
dtype: int64

In [27]:
x=pd.Series([1,2,3,4],index=["b","a","d","c"])

In [28]:
x["b":"d"] #--x[0:2+1]

b    1
a    2
d    3
dtype: int64

In [45]:
x["d":"b":-1] #--x[2:0]

d    3
a    2
b    1
dtype: int64

In [46]:
x

b    1
a    2
d    3
c    4
dtype: int64

In [47]:
x=pd.Series([1,2,3,4],index=["a","b","c","d"])
x

a    1
b    2
c    3
d    4
dtype: int64

In [48]:
x["a"]

1

In [49]:
x[["a","c","d","b"]]

a    1
c    3
d    4
b    2
dtype: int64

In [54]:
x=pd.Series([1,2,3,4,5],index=["a","b","c","d","a"])
x["a"]=100
x

a    100
b      2
c      3
d      4
a    100
dtype: int64

In [55]:
x=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [57]:
x["b"]=1000
x

a       1
b    1000
c       3
d       4
e       5
dtype: int64

In [58]:
x["f"]=0
x

a       1
b    1000
c       3
d       4
e       5
f       0
dtype: int64

In [68]:
x["f"]=10
x

a       1
b    1000
c       3
d       4
e       5
f      10
dtype: int64

In [69]:
# How to delet the elements in the series

In [70]:
x

a       1
b    1000
c       3
d       4
e       5
f      10
dtype: int64

In [71]:
del x["f"]
x

a       1
b    1000
c       3
d       4
e       5
dtype: int64

In [73]:
x["a":"c"]=0,1,2
x

a    0
b    1
c    2
d    4
e    5
dtype: int64

In [75]:
x[0:2]=10,11
x

a    10
b    11
c     2
d     4
e     5
dtype: int64

In [78]:
x

a    10
b    11
c     2
d     4
e     5
dtype: int64

In [ ]:
# delete the elements from a to c

In [79]:
del x["a":"c"] #----> We cant del the elements using slicing,( use for loop )

InvalidIndexError: slice('a', 'c', None)

In [80]:
del x[["a","b","c"]]

InvalidIndexError: ['a', 'b', 'c']

In [83]:
x=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
x=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
for y in range(int(input("how many elemnts you want to remove: "))):
    del x[input("a,b,c,d,e")]

how many elemnts you want to remove: 3
a,b,c,d,ea
a,b,c,d,eb
a,b,c,d,ec

In [4]:
x

d    4
e    5
dtype: int64

In [5]:
for y in range(int(input("how many elemnts you want to remove"))):
    del x[input("a,b,c,d,e")]

how many elemnts you want to remove2
a,b,c,d,ed
a,b,c,d,ee

In [6]:
x

Series([], dtype: int64)

## 23 Aug 2022

In [ ]:
# *** DATA FRAME***
'''A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.'''

In [1]:
import pandas as pd

In [2]:
pd.DataFrame([1,2,3,4,5])   
# Data frame returns you a column values when we give one list( it is considerd as the column)
# Default Indexing starts from 0------.

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
x=pd.DataFrame((1,2,3,4,5),(6,7,8,9,10))
x
# hear the 1,2,3,4,5 are the values given and print in column,and 6,7,8,9,10 are the indexing labells

    0
6   1
7   2
8   3
9   4
10  5

In [14]:
pd.DataFrame([1,2,3,4,5],[6,7,8,9,10],[11])   
# if you are not giving in 2d then the elements are considerd as data, x,y labels
# 1,2,3,4,5 are the 1d array and 6,7,8,9,10 are index(row) labell and 11 is columns labell

    11
6    1
7    2
8    3
9    4
10   5

In [ ]:
# How to print 2d DataFrame.

In [17]:
x=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]])   
x
# 1,2,3,4,5 are first row and 6,7,8,9,10 are 2nd row and deflt indexing starts from 0

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [18]:
x2=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]])   
x2

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [ ]:
# ROW Labelling and Columns labelling

In [58]:
x2=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]],index=['a','b','c'],columns=['A','B','C',"D",'E'])   
x2

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15

In [59]:
x2['A':'C']

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [40]:
x2[['A':'C']] # -----> we cant access the elements column wise using slising based.

SyntaxError: invalid syntax (1876147871.py, line 1)

In [41]:
x2[['A','B','C']]

    A   B   C
a   1   2   3
b   6   7   8
c  11  12  13

In [42]:
x2['a':'c']  #-----> you can use slising for rows accessing.

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15

In [ ]:
# try to access element 11 and 8

In [64]:
x2['A']['c']

11

In [66]:
x2['C']['b']

8

In [47]:
x2['A']

a     1
b     6
c    11
Name: A, dtype: int64

In [67]:
x2['A':'C']

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [51]:
x2['a']

KeyError: 'a'

In [50]:
x2['a':'c']

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15

In [53]:
x2['a':'b']

   A  B  C  D   E
a  1  2  3  4   5
b  6  7  8  9  10

In [52]:
x2["a":"c","A":'C']

InvalidIndexError: (slice('a', 'c', None), slice('A', 'C', None))

In [56]:
x2["A":"C"]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [57]:
x2[['A','B','C']]

    A   B   C
a   1   2   3
b   6   7   8
c  11  12  13

In [21]:
x3=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]],index=['a','b','c'],columns=['A','B','C',"D",'E'],dtype=float)   
x3

      A     B     C     D     E
a   1.0   2.0   3.0   4.0   5.0
b   6.0   7.0   8.0   9.0  10.0
c  11.0  12.0  13.0  14.0  15.0

In [26]:
x4=pd.DataFrame([['P1',23,'m',5.6,81],['p2',24,'m',5.6,83],['p3',25,'m',5.6,85],['p4',26,'f',5.9,87],['p5',27,'m',5.7,89],['p6',28,'f',5.6,82],['p7',29,'m',5.1,83]],columns=['name','age','gender','height','weight'])
x4

  name  age gender  height  weight
0   P1   23      m     5.6      81
1   p2   24      m     5.6      83
2   p3   25      m     5.6      85
3   p4   26      f     5.9      87
4   p5   27      m     5.7      89
5   p6   28      f     5.6      82
6   p7   29      m     5.1      83

In [27]:
# Dictionary {Keys:Column}

In [28]:
# Key are Column Labell and
# Values ae Column values

In [30]:
x5=pd.DataFrame({'Name':['p1',"p2",'p3','p4','p5',"p6",'p7'],'Age':[23,24,25,26,27,28,29]})
x5
# hear Name and Age are the column labell

  Name  Age
0   p1   23
1   p2   24
2   p3   25
3   p4   26
4   p5   27
5   p6   28
6   p7   29

In [3]:
x6=pd.DataFrame({'Name':['p1',"p2",'p3','p4','p5',"p6",'p7'],'Age':[23,24,25,26,27,28,29]},columns=['Name'])
x6

  Name
0   p1
1   p2
2   p3
3   p4
4   p5
5   p6
6   p7

In [4]:
x6=pd.DataFrame({'Name':['p1',"p2",'p3','p4','p5',"p6",'p7'],'Age':[23,24,25,26,27,28,29]},columns=['Name','height'])
x6

  Name height
0   p1    NaN
1   p2    NaN
2   p3    NaN
3   p4    NaN
4   p5    NaN
5   p6    NaN
6   p7    NaN

In [ ]:
# since there is no height column in the given data frame x6 the values are considered as NaN (Not a number)

In [19]:
x6=pd.DataFrame({'Name':['p1',"p2",'p3','p4','p5',"p6",'p7'],'Age':[23,24,25,26,27,28,29]},columns=['Name','Age','height'])
x6

  Name  Age height
0   p1   23    NaN
1   p2   24    NaN
2   p3   25    NaN
3   p4   26    NaN
4   p5   27    NaN
5   p6   28    NaN
6   p7   29    NaN

In [6]:
x6['height'] # output will not come because height is not define  (only nan values will be printed.)

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
Name: height, dtype: object

In [7]:
# Hear we can use a python list or pandas Series for adding the new columns

In [8]:
# Using List
x6['height']=[55,56,57,58,59,60,31]
x6

  Name  Age  height
0   p1   23      55
1   p2   24      56
2   p3   25      57
3   p4   26      58
4   p5   27      59
5   p6   28      60
6   p7   29      31

In [9]:
x6

  Name  Age  height
0   p1   23      55
1   p2   24      56
2   p3   25      57
3   p4   26      58
4   p5   27      59
5   p6   28      60
6   p7   29      31

In [9]:
x6['height']=[55,56,57,58,59,60]
x6

ValueError: Length of values (6) does not match length of index (7)

In [ ]:
# in python list if number of elments are not matching to length then it gives an error, 
#in pandas series the missing values are replaced by a Nan value

In [10]:
# Using Series

In [10]:
x6['height']=pd.Series([55,56,57,58,59,60])
x6

  Name  Age  height
0   p1   23    55.0
1   p2   24    56.0
2   p3   25    57.0
3   p4   26    58.0
4   p5   27    59.0
5   p6   28    60.0
6   p7   29     NaN

In [11]:
x6['Age']=pd.Series([55,56,57,58,59,60])
x6
# If ther is any missing value the Series gives a NaN

  Name   Age  height
0   p1  55.0      55
1   p2  56.0      56
2   p3  57.0      57
3   p4  58.0      58
4   p5  59.0      59
5   p6  60.0      60
6   p7   NaN      31

In [12]:
x6['Age']=pd.Series([55,56,57,58,59,60,87])
x6

  Name  Age  height
0   p1   55      55
1   p2   56      56
2   p3   57      57
3   p4   58      58
4   p5   59      59
5   p6   60      60
6   p7   87      31

In [13]:
x6['Age']=pd.Series([55,56,57,58,59,60])
x6

  Name   Age  height
0   p1  55.0      55
1   p2  56.0      56
2   p3  57.0      57
3   p4  58.0      58
4   p5  59.0      59
5   p6  60.0      60
6   p7   NaN      31

In [14]:
# replacing the values of Age

In [15]:
x6['Age']=pd.Series([81,82,83,84,85,86,87])
x6

  Name  Age  height
0   p1   81      55
1   p2   82      56
2   p3   83      57
3   p4   84      58
4   p5   85      59
5   p6   86      60
6   p7   87      31

In [21]:
x6

  Name  Age height
0   p1   23    NaN
1   p2   24    NaN
2   p3   25    NaN
3   p4   26    NaN
4   p5   27    NaN
5   p6   28    NaN
6   p7   29    NaN

In [24]:
x6['Name']

0    p1
1    p2
2    p3
3    p4
4    p5
5    p6
6    p7
Name: Name, dtype: object

In [23]:
for i in x6['Name']:
    i=i+'a'

In [61]:
# Adding new column in a Data Frame
x6['BMI']=x6['weight']/x6['height']
x6

  Name  height  Age  weight       BMI
0   p1      55   81      55  1.000000
1   p2      56   82      56  1.000000
2   p3      57   83      57  1.000000
3   p4      58   84      58  1.000000
4   p5      59   85      59  1.000000
5   p6      60   86      60  1.000000
6   p7      31   87      81  2.612903

In [62]:
#how to Delete the Columns

In [63]:
del x6['Age']
x6

  Name  height  weight       BMI
0   p1      55      55  1.000000
1   p2      56      56  1.000000
2   p3      57      57  1.000000
3   p4      58      58  1.000000
4   p5      59      59  1.000000
5   p6      60      60  1.000000
6   p7      31      81  2.612903

In [28]:
y=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,2]])
y

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  2

In [29]:
y[0]

0    1
1    6
Name: 0, dtype: int64

In [30]:
y[1]

0    2
1    7
Name: 1, dtype: int64

In [32]:
y[0:1] # -----> it will take row wise

   0  1  2  3  4
0  1  2  3  4  5

In [33]:
y[0:2]

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  2

In [1]:
# 24 Aug 2022

In [ ]:
# How to Access rows

In [14]:
import pandas as pd

In [15]:
data=pd.DataFrame({'Name':['p1','p2','p3','p4','p5','p6'],'Age':[27,43,56,23,89,32],'Genger':['m','f','m','m','f','f'],'Height':[156.2,143.2,167.8,132.5,165.4,178.5]})

In [16]:
data

  Name  Age Genger  Height
0   p1   27      m   156.2
1   p2   43      f   143.2
2   p3   56      m   167.8
3   p4   23      m   132.5
4   p5   89      f   165.4
5   p6   32      f   178.5

In [17]:
# we have two ways to acces the elements 
# 1) loc--(labell based indexing)(eg=a,b,c,d,e)
# 2) iloc--(integer based access or default indexing)
# loc and iloc are techinec to acces the element it is not a function.

In [18]:
data

  Name  Age Genger  Height
0   p1   27      m   156.2
1   p2   43      f   143.2
2   p3   56      m   167.8
3   p4   23      m   132.5
4   p5   89      f   165.4
5   p6   32      f   178.5

In [19]:
data[0] #--->it checks column wise

KeyError: 0

In [20]:
# to get the information of first person

In [21]:
data.loc[0]

Name         p1
Age          27
Genger        m
Height    156.2
Name: 0, dtype: object

In [22]:
data.loc[0:3] # for default indexing for rows we will get till the  end value

  Name  Age Genger  Height
0   p1   27      m   156.2
1   p2   43      f   143.2
2   p3   56      m   167.8
3   p4   23      m   132.5

In [23]:
data.iloc[0:3]  # in iloc the ending index will not be included.

  Name  Age Genger  Height
0   p1   27      m   156.2
1   p2   43      f   143.2
2   p3   56      m   167.8

In [11]:
data=pd.DataFrame({'Name':['p1','p2','p3','p4','p5','p6'],'Age':[27,43,56,23,89,32],'Genger':['m','f','m','m','f','f'],'Height':[156.2,143.2,167.8,132.5,165.4,178.5]},index=[1,2,3,4,5,6])
data

  Name  Age Genger  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [25]:
data.loc[0:3]    # loc goes element wise indexing

  Name  Age Genger  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8

In [26]:
data.iloc[0:3]  # iloc takes default indexing

  Name  Age Genger  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8

In [12]:
data.loc[1:4]

  Name  Age Genger  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5

In [13]:
data.iloc[1:4]

  Name  Age Genger  Height
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5

In [28]:
data=pd.DataFrame({'Name':['p1','p2','p3','p4','p5','p6'],'Age':[27,43,56,23,89,32],'Genger':['m','f','m','m','f','f'],'Height':[156.2,143.2,167.8,132.5,165.4,178.5]},index=['a','b','c','d','e','f'])
data

  Name  Age Genger  Height
a   p1   27      m   156.2
b   p2   43      f   143.2
c   p3   56      m   167.8
d   p4   23      m   132.5
e   p5   89      f   165.4
f   p6   32      f   178.5

In [29]:
data.loc[0:3] #-- Error because the lablle of rows are chaged

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [30]:
data.iloc[0:3]

  Name  Age Genger  Height
a   p1   27      m   156.2
b   p2   43      f   143.2
c   p3   56      m   167.8

In [14]:
data=pd.DataFrame({'Name':['p1','p2','p3','p4','p5','p6'],'Age':[27,43,56,23,89,32],'Genger':['m','f','m','m','f','f'],'Height':[156.2,143.2,167.8,132.5,165.4,178.5]},index=[10,11,12,13,14,15])
data

   Name  Age Genger  Height
10   p1   27      m   156.2
11   p2   43      f   143.2
12   p3   56      m   167.8
13   p4   23      m   132.5
14   p5   89      f   165.4
15   p6   32      f   178.5

In [ ]:
data.loc[0] #-- Error (index labell changed)

In [32]:
data.loc[10]

Name         p1
Age          27
Genger        m
Height    156.2
Name: 10, dtype: object

In [ ]:
data.iloc[10]  #--Error--> Iloc takes only default indexing

In [15]:
data.iloc[0]

Name         p1
Age          27
Genger        m
Height    156.2
Name: 10, dtype: object

In [36]:
data.iloc[1]

Name         p2
Age          43
Genger        f
Height    143.2
Name: 11, dtype: object

In [37]:
data.iloc[2]

Name         p3
Age          56
Genger        m
Height    167.8
Name: 12, dtype: object

In [38]:
data.loc[13]

Name         p4
Age          23
Genger        m
Height    132.5
Name: 13, dtype: object

In [39]:
data

   Name  Age Genger  Height
10   p1   27      m   156.2
11   p2   43      f   143.2
12   p3   56      m   167.8
13   p4   23      m   132.5
14   p5   89      f   165.4
15   p6   32      f   178.5

In [14]:
data=pd.DataFrame({'Name':['p1','p2','p3','p4','p5','p6'],'Age':[27,43,56,23,89,32],'Gender':['m','f','m','m','f','f'],'Height':[156.2,143.2,167.8,132.5,165.4,178.5]},index=[1,2,3,4,5,6])
data

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [17]:
data.loc[0]

KeyError: 0

In [18]:
data.loc[1]

Name         p1
Age          27
Gender        m
Height    156.2
Name: 1, dtype: object

In [ ]:
# print first three roaws

In [76]:
data.loc[0:3]

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8

In [77]:
data

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [ ]:
# print all male in the data

In [16]:
data[(data['Gender']=='m') | (data['Gender']=='f')]

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [78]:
data.loc[data['Gender']=='m']

  Name  Age Gender  Height
1   p1   27      m   156.2
3   p3   56      m   167.8
4   p4   23      m   132.5

In [ ]:
# print all female and male persons in data

In [80]:
data.loc[(data['Gender']=='m') | (data['Gender']=='f')]

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [ ]:
# print the men who's height is greater then 143.2

In [81]:
data.loc[(data['Gender']=='m') & (data['Height']>143.2)]

  Name  Age Gender  Height
1   p1   27      m   156.2
3   p3   56      m   167.8

In [ ]:
# print the male person whose height is greater then 143.2 and print only name and gender column

In [83]:
data.loc[(data['Gender']=='m') & (data['Height']>143.2),['Name','Gender']]

  Name Gender
1   p1      m
3   p3      m

In [ ]:
# From the data if gender is male then replace there height to 0

In [85]:
data.loc[data['Gender']=='m',['Height']]=0
data

  Name  Age Gender  Height
1   p1   27      m     0.0
2   p2   43      f   143.2
3   p3   56      m     0.0
4   p4   23      m     0.0
5   p5   89      f   165.4
6   p6   32      f   178.5

In [86]:
data

  Name  Age Gender  Height
1   p1   27      m     0.0
2   p2   43      f   143.2
3   p3   56      m     0.0
4   p4   23      m     0.0
5   p5   89      f   165.4
6   p6   32      f   178.5

In [ ]:
# if gender is male then replce the height with 0 and age to 1

In [87]:
data.loc[data['Gender']=='m',['Height','Age']]=[0,1]
data

  Name  Age Gender  Height
1   p1    1      m     0.0
2   p2   43      f   143.2
3   p3    1      m     0.0
4   p4    1      m     0.0
5   p5   89      f   165.4
6   p6   32      f   178.5

In [88]:
data

  Name  Age Gender  Height
1   p1    1      m     0.0
2   p2   43      f   143.2
3   p3    1      m     0.0
4   p4    1      m     0.0
5   p5   89      f   165.4
6   p6   32      f   178.5

In [ ]:
# print all the data using slicing

In [89]:
data.loc[:,:]

  Name  Age Gender  Height
1   p1    1      m     0.0
2   p2   43      f   143.2
3   p3    1      m     0.0
4   p4    1      m     0.0
5   p5   89      f   165.4
6   p6   32      f   178.5

In [ ]:
# print the rows from 3 to 5

In [90]:
data.loc[3:5]

  Name  Age Gender  Height
3   p3    1      m     0.0
4   p4    1      m     0.0
5   p5   89      f   165.4

In [ ]:
# print all rows and Age gender and height column

In [92]:
data.loc[:,'Age':'Height']

   Age Gender  Height
1    1      m     0.0
2   43      f   143.2
3    1      m     0.0
4    1      m     0.0
5   89      f   165.4
6   32      f   178.5

In [ ]:
# print 4,5,6 rows and Age and Name column only.

In [19]:
data

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [20]:
data.loc[4:6,'Name':'Age']

  Name  Age
4   p4   23
5   p5   89
6   p6   32

In [21]:
data.iloc[3:6,0:2]

  Name  Age
4   p4   23
5   p5   89
6   p6   32

In [1]:
# 25 Aug 2022

In [2]:
import pandas as pd
import numpy as np

In [3]:
data1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
data1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
# to add new row we use append() method

In [ ]:
# when the new valus are added then the new rows indexing will starts from 0

In [4]:
data1=data1.append([[10,11,12],[100,200,300,400]])
data1

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_13276\950245514.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data1=data1.append([[10,11,12],[100,200,300,400]])

     0    1    2      3
0    1    2    3    NaN
1    4    5    6    NaN
2    7    8    9    NaN
0   10   11   12    NaN
1  100  200  300  400.0

In [ ]:
# when the new valus are added then the new rows indexing will starts from 0 to avoid this we make "ignore_index=True", 
#so we get the indexing contine values.

In [5]:
data1=data1.append([[22,23,24],[25,26,27,28]],ignore_index=True)
data1

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_13276\2998776442.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data1=data1.append([[22,23,24],[25,26,27,28]],ignore_index=True)

     0    1    2      3
0    1    2    3    NaN
1    4    5    6    NaN
2    7    8    9    NaN
3   10   11   12    NaN
4  100  200  300  400.0
5   22   23   24    NaN
6   25   26   27   28.0

In [19]:
data=pd.DataFrame({"Name":["p1","p2",'p3','p4','p5','p6'],"Gender":["m","f","m","m","f","f"],"Age":[27,43,56,23,89,32]})
data

  Name Gender  Age
0   p1      m   27
1   p2      f   43
2   p3      m   56
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [22]:
data=data.append({"Name":100,"Gender":1000,"Age":400,"weght":700},ignore_index=True)

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_13276\3308338267.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data=data.append({"Name":100,"Gender":1000,"Age":400,"weght":700},ignore_index=True)

In [23]:
data

  Name Gender  Age  weght
0   p1      m   27    NaN
1   p2      f   43    NaN
2   p3      m   56    NaN
3   p4      m   23    NaN
4   p5      f   89    NaN
5   p6      f   32    NaN
6  100   1000  400  700.0

In [26]:
data=data.append({"Name":100,"Gender":1000,"Age":400,"weght":700,'Height':800},ignore_index=True)

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_13276\4118932459.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data=data.append({"Name":100,"Gender":1000,"Age":400,"weght":700,'Height':800},ignore_index=True)

In [27]:
data

  Name Gender  Age  weght  Height
0   p1      m   27    NaN     NaN
1   p2      f   43    NaN     NaN
2   p3      m   56    NaN     NaN
3   p4      m   23    NaN     NaN
4   p5      f   89    NaN     NaN
5   p6      f   32    NaN     NaN
6  100   1000  400  700.0     NaN
7  100   1000  400  700.0   800.0

In [101]:
df1=data[0:3]
df1

  Name Gender  Age
0   p1      m   27
1   p2      f   43
2   p3      m   56

In [102]:
df2=data[3:]
df2

  Name Gender  Age
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [103]:
df1=df1.append(df2)
df1

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_10724\1434511714.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1=df1.append(df2)

  Name Gender  Age
0   p1      m   27
1   p2      f   43
2   p3      m   56
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [104]:
# drop ---> to deleting the rows

In [105]:
df1

  Name Gender  Age
0   p1      m   27
1   p2      f   43
2   p3      m   56
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [106]:
# to delet the row 2.

In [107]:
df1.drop(2)

  Name Gender  Age
0   p1      m   27
1   p2      f   43
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [108]:
df1 # but the effect is not shown on orginal data df1.use inplace=True make view

  Name Gender  Age
0   p1      m   27
1   p2      f   43
2   p3      m   56
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [109]:
# inplace=True make view

In [110]:
df1.drop(2,inplace=True)

In [111]:
df1

  Name Gender  Age
0   p1      m   27
1   p2      f   43
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [112]:
df3=df1.drop(4,inplace=False)
df3

  Name Gender  Age
0   p1      m   27
1   p2      f   43
3   p4      m   23
5   p6      f   32

In [113]:
df1

  Name Gender  Age
0   p1      m   27
1   p2      f   43
3   p4      m   23
4   p5      f   89
5   p6      f   32

In [114]:
df3=df1.drop(4)
df3

  Name Gender  Age
0   p1      m   27
1   p2      f   43
3   p4      m   23
5   p6      f   32

In [115]:
df3

  Name Gender  Age
0   p1      m   27
1   p2      f   43
3   p4      m   23
5   p6      f   32

In [116]:
# Deleteing the columns using drop.

In [117]:
df1.drop(["Name"],axis='columns',inplace=True)
df1

  Gender  Age
0      m   27
1      f   43
3      m   23
4      f   89
5      f   32

In [118]:
df1.drop(["Age"],axis=1,inplace=True)
df1

  Gender
0      m
1      f
3      m
4      f
5      f

In [119]:
df1.drop(columns=["Gender"],inplace=True)
df1

Empty DataFrame
Columns: []
Index: [0, 1, 3, 4, 5]

In [12]:
import pandas as pd

In [ ]:
# by using drop() method we can delete n number of columns

In [6]:
data=pd.DataFrame({'Name':['p1','p2','p3','p4','p5','p6'],'Age':[27,43,56,23,89,32],'Gender':['m','f','m','m','f','f'],'Height':[156.2,143.2,167.8,132.5,165.4,178.5]},index=[1,2,3,4,5,6])
data

  Name  Age Gender  Height
1   p1   27      m   156.2
2   p2   43      f   143.2
3   p3   56      m   167.8
4   p4   23      m   132.5
5   p5   89      f   165.4
6   p6   32      f   178.5

In [ ]:
# removing multiple columns at a time.

In [7]:
data.drop(columns=["Gender",'Height','Age'],inplace=True)
data

  Name
1   p1
2   p2
3   p3
4   p4
5   p5
6   p6

In [11]:
# 26 Aug 2022

In [ ]:
# Usecols=[]
'''Return a subset of the columns. If list-like, all elements must either be 
positional (i.e. integer indices into the document columns) or strings that 
correspond to column names provided either by the user in names or inferred 
from the document header row(s). '''

In [15]:
data=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# to print only perticular columnsfrom the gib=ven dataset use 'usecols'

In [18]:
data=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\titanic.csv",usecols=['Name','Sex','Age'])
data

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male  27.0
887                       Graham, Miss. Margaret Edith  female  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  26.0
890                                Dooley, Mr. Patrick    male  32.0

[891 rows x 3 columns]

In [ ]:
# names[]

In [19]:
x=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123.csv")
x

     p3   2  m
0    p4   3  f
1    p5   4  m
2    p6   5  f
3    p7   6  m
4    p8   7  f
5    p9   8  m
6   p10   9  f
7   p11  10  m
8   p12  11  f
9   p13  12  m
10  p14  13  f

In [ ]:
# Sinse our dataset x donot contain the column
#heading creat labels to them by using names=[]

In [50]:
x1=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123.csv",names=['Name','Age','Sex'])
x1

   Name  Age Sex
0    p3    2   m
1    p4    3   f
2    p5    4   m
3    p6    5   f
4    p7    6   m
5    p8    7   f
6    p9    8   m
7   p10    9   f
8   p11   10   m
9   p12   11   f
10  p13   12   m
11  p14   13   f

In [ ]:
# What happen if there are any pre defied label for the given dataset.

In [25]:
x=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123-1.csv")
x

  name  age sex
0   p1    1   m
1   p2    2   f
2   p3    3   f
3   p4    4   m
4   p5    5   m
5   p6    6   f
6   p7    7   f
7   p8    8   m
8   p9    9   m

In [48]:
x=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123-1.csv",header=None,names=['name','age','gender'])
x

   name  age gender
0  Name  Age    Sex
1    p1    1      m
2    p2    2      f
3    p3    3      f
4    p4    4      m
5    p5    5      m
6    p6    6      f
7    p7    7      f
8    p8    8      m
9    p9    9      m

In [42]:
x=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123-1.csv",header=1)
x

   p1  1  m
0  p2  2  f
1  p3  3  f
2  p4  4  m
3  p5  5  m
4  p6  6  f
5  p7  7  f
6  p8  8  m
7  p9  9  m

In [56]:
x1

   Name  Age Sex
0    p3    2   m
1    p4    3   f
2    p5    4   m
3    p6    5   f
4    p7    6   m
5    p8    7   f
6    p9    8   m
7   p10    9   f
8   p11   10   m
9   p12   11   f
10  p13   12   m
11  p14   13   f

In [ ]:
# To print the pertiular rows from the data frame use 'nrows='

In [58]:
x1=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123.csv",names=['Name','Age','Sex'],nrows=5)
x1

  Name  Age Sex
0   p3    2   m
1   p4    3   f
2   p5    4   m
3   p6    5   f
4   p7    6   m

In [ ]:
# Skip values

In [59]:
x1=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123.csv",names=['Name','Age','Sex'],skiprows=[1,3,5,7])
x1

  Name  Age Sex
0   p3    2   m
1   p5    4   m
2   p7    6   m
3   p9    8   m
4  p11   10   m
5  p12   11   f
6  p13   12   m
7  p14   13   f

In [ ]:
# na_values[]

In [72]:
x1=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\Book123-1.csv",na_values[64,'m'])
x1

NameError: name 'na_values' is not defined

## 29 Aug 2022

In [5]:
import pandas as pd

In [ ]:
# as we convert the csv file into DataFrame can can also convert the text file into the DataFrame

In [44]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes vinay\\vin.txtfile.txt")
data

        1-2-3-85-5-3-2-6
0  7-56-2-63--65-6-5-7-8

In [45]:
# in real time the tex is not separated by only ',' , it may be saperated by '-' or ' ' and .....etc.

In [46]:
# So to come out of this situation we use delimiter to break the values in the given text file.

In [47]:
data1=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes vinay\\vin.txtfile.txt",delimiter='-')
data1

      1   2   3  85  5  3.1  2.1  6
7 56  2  63 NaN  65  6    5    7  8

In [20]:
data1=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\vin.txtfile.txt",delimiter='-',header=None,names=['a','b','c','d','e','g','h','i','j','k'])
data1

   a   b  c   d    e   g  h  i    j    k
0  1   2  3  85  5.0   3  2  6  NaN  NaN
1  7  56  2  63  NaN  65  6  5  7.0  8.0

In [ ]:
# Converting the DataFrame to CSV File----> to_csv

In [50]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes vinay\\titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# once after we perform the different tool and operation on the DataFrame,
# we needed to convert the DF into CSV back to convert we use 'varianblr.to_csv(pth\filename.csv)'

In [52]:
df1=data[["PassengerId","Pclass"]]
df1

     PassengerId  Pclass
0              1       3
1              2       1
2              3       3
3              4       1
4              5       3
..           ...     ...
886          887       2
887          888       1
888          889       3
889          890       1
890          891       3

[891 rows x 2 columns]

In [53]:
df1.to_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes vinay\\afterchnge.csv")
df1

     PassengerId  Pclass
0              1       3
1              2       1
2              3       3
3              4       1
4              5       3
..           ...     ...
886          887       2
887          888       1
888          889       3
889          890       1
890          891       3

[891 rows x 2 columns]

In [ ]:
# hear the index is making a new colums so to avoid this use index=False

In [54]:
df1.to_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes vinay\\afterchnge.csv",index=False)
df1

     PassengerId  Pclass
0              1       3
1              2       1
2              3       3
3              4       1
4              5       3
..           ...     ...
886          887       2
887          888       1
888          889       3
889          890       1
890          891       3

[891 rows x 2 columns]

In [ ]:
# Attributes and methods to axies the serie and DataFrame

In [ ]:
# DataFrame ==== data and Series ==== data1

In [55]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [56]:
data1=pd.Series([1,2,3,4,5,6,7,8,9,10])
data1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
# 1. axes--> Return a list representing the axes of the Series/DataFrame.
#It has the row axis labels and column axis labels as the only members. They are returned in that order.

In [57]:
data.axes # for DataFrame

[RangeIndex(start=0, stop=891, step=1),
 Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
        'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
       dtype='object')]

In [58]:
data1.axes  # for series

[RangeIndex(start=0, stop=10, step=1)]

In [59]:
# Example 2
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df

   col1  col2
0     1     3
1     2     4

In [60]:
df.axes

[RangeIndex(start=0, stop=2, step=1), Index(['col1', 'col2'], dtype='object')]

In [ ]:
# columns

In [ ]:
# To know all the columns labells we use the columns and,
#it will work only on the DataFrame not on Series (The column labels of the DataFrame.)

In [62]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [63]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [ ]:
# index-----> The index (row labels) of the DataFrame.

In [64]:
data.index

RangeIndex(start=0, stop=891, step=1)

In [65]:
data1.index

RangeIndex(start=0, stop=10, step=1)

In [66]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [ ]:
# Head ---->Return the first n rows. This function returns the first n rows for the object based on position. It is useful for quickly testing,
#if your object has the right type of data in it.
#n=default 5
#Number of rows to select.

In [70]:
df1 = pd.DataFrame({'animal': ['alligator', 'bee', 'falcon', 'lion',
                   'monkey', 'parrot', 'shark', 'whale', 'zebra']})
df1

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

In [71]:
df1.head()

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey

In [72]:
df1.head(7)

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark

In [73]:
df1.head(-3)
#For negative values of n, this function returns all rows except the last n rows, equivalent to df[:-n].

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot

In [ ]:
# tail ---->

'''Return the last n rows.

This function returns last n rows from the object based on position. It is useful for quickly verifying data, for example, after sorting or appending rows.

For negative values of n, this function returns all rows except the first n rows, equivalent to df[n:].'''

In [74]:
df2 = pd.DataFrame({'animal': ['alligator', 'bee', 'falcon', 'lion',
                   'monkey', 'parrot', 'shark', 'whale', 'zebra']})
df2

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

In [75]:
df.tail()

   animal
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [76]:
df.tail(3)

  animal
6  shark
7  whale
8  zebra

In [77]:
df.tail(-3)
# For negative values of n, this function returns all rows except the first n rows, equivalent to df[n:].

   animal
3    lion
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [ ]:
# shape ---> Return a tuple representing the dimensionality of the DataFrame.

In [78]:
df3= pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df3

   col1  col2
0     1     3
1     2     4

In [79]:
df3.shape

(2, 2)

In [80]:
data.shape

(891, 12)

In [81]:
data1.shape

(10,)

In [ ]:
#.transpose ----> '''Transpose index and columns.

Reflect the DataFrame over its main diagonal by writing rows as columns and vice-versa.
The property T is an accessor to the method transpose().'''

In [88]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [82]:
data.T

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male
Age,22.0,38.0,26.0,35.0,35.0,NaN,54.0,2.0,27.0,14.0,...,33.0,22.0,28.0,25.0,39.0,27.0,19.0,NaN,26.0,32.0
SibSp,1,1,0,1,0,0,0,3,0,1,...,0,0,0,0,0,0,0,1,0,0
Parch,0,0,0,0,0,0,0,1,2,0,...,0,0,0,0,5,0,0,2,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,113803,373450,330877,17463,349909,347742,237736,...,349257,7552,C.A./SOTON 34068,SOTON/OQ 392076,382652,211536,112053,W./C. 6607,111369,370376
Fare,7.25,71.2833,7.925,53.1,8.05,8.4583,51.8625,21.075,11.1333,30.0708,...,7.8958,10.5167,10.5,7.05,29.125,13.0,30.0,23.45,30.0,7.75
Cabin,NaN,C85,NaN,C123,NaN,NaN,E46,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,B42,NaN,C148,NaN
Embarked,S,C,S,S,S,Q,S,S,S,C,...,S,S,S,S,Q,S,S,S,C,Q

In [86]:
df3

   col1  col2
0     1     3
1     2     4

In [87]:
df3.T

      0  1
col1  1  2
col2  3  4

In [ ]:
# values ----> Return a Numpy representation of the DataFrame.

In [91]:
df4= pd.DataFrame({'age':    [ 3,  29,25],
                   'height': [94, 170,159],
                   'weight': [31, 115,632]})
df4

   age  height  weight
0    3      94      31
1   29     170     115
2   25     159     632

In [92]:
df4.values # it only returns you the values that are present inside the DataFtame

array([[  3,  94,  31],
       [ 29, 170, 115],
       [ 25, 159, 632]], dtype=int64)

In [93]:
data.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [94]:
data1.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [ ]:
# empty ------>'''Indicator whether Series/DataFrame is empty.

True if Series/DataFrame is entirely empty (no items), meaning any of the axes are of length 0.

Returns
bool
If Series/DataFrame is empty, return True, if not return False.'''

In [95]:
df5 = pd.DataFrame({'A' : []})
df5

Empty DataFrame
Columns: [A]
Index: []

In [96]:
df5.empty

True

In [97]:
data.empty

False

In [99]:
import numpy as np

In [100]:
df6 = pd.DataFrame({'A' : [np.nan]})
df6

    A
0 NaN

In [101]:
df6.empty

False

In [ ]:
# If we only have NaNs in our DataFrame, 
#it is not considered empty! We will need to drop the NaNs to make the DataFrame empty:

In [102]:
df6.dropna().empty

True

In [104]:
# ndim----> 
'''Return an int representing the number of axes / array dimensions.

Return 1 if Series. Otherwise return 2 if DataFrame.'''

'Return an int representing the number of axes / array dimensions.\n\nReturn 1 if Series. Otherwise return 2 if DataFrame.'

In [105]:
data1.ndim

1

In [106]:
data.ndim

2

In [108]:
df7=pd.Series({'a': 1, 'b': 2, 'c': 3})
df7

a    1
b    2
c    3
dtype: int64

In [109]:
df7.ndim

1

In [110]:
df8= pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df8.ndim

2

In [ ]:
# size --->
'''Return an int representing the number of elements in this object.

Return the number of rows if Series.
Otherwise return the number of rows times number of columns if DataFrame.'''

In [2]:
s = pd.Series({'a': 1, 'b': 2, 'c': 3})
print(s)
s.size

a    1
b    2
c    3
dtype: int64

3

In [112]:
data1.size

10

In [113]:
data.size

10692

In [115]:
df9= pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df9

   col1  col2
0     1     3
1     2     4

In [116]:
df9.size

4

In [ ]:
# info()----> 
'''Print a concise summary of a DataFrame.

This method prints information about a DataFrame
including the index dtype and columns, non-null values and memory usage.'''

In [117]:
int_values = [1, 2, 3, 4, 5]
text_values = ['alpha', 'beta', 'gamma', 'delta', 'epsilon']
float_values = [0.0, 0.25, 0.5, 0.75, 1.0]
data2= pd.DataFrame({"int_col": int_values, "text_col": text_values,
                  "float_col": float_values})
data2

   int_col text_col  float_col
0        1    alpha       0.00
1        2     beta       0.25
2        3    gamma       0.50
3        4    delta       0.75
4        5  epsilon       1.00

In [ ]:
#Prints information of all columns:

In [119]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   int_col    5 non-null      int64
 1   text_col   5 non-null      object
 2   float_col  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [121]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [123]:
data1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [122]:
data1.info()

<class 'pandas.core.series.Series'>
RangeIndex: 10 entries, 0 to 9
Series name: None
Non-Null Count  Dtype
--------------  -----
10 non-null     int64
dtypes: int64(1)
memory usage: 208.0 bytes

In [ ]:
# Object Data Type

In [124]:
x=np.array([1,1.1,'a'])
x   # hear all the values will converted into string datatype.

array(['1', '1.1', 'a'], dtype='<U32')

In [126]:
# when we use object datatype

y=np.array([1,1.1,'a'],dtype=object)
y  # the dtype of the values will not be changed the elements act as unique elements.

array([1, 1.1, 'a'], dtype=object)

In [ ]:
# Discribe()  ----> 
'''describe() The describe() method is used for calculating some statistical data like
percentile, mean and std of the numerical values of the Series or DataFrame'''

In [134]:
data5 = [[10, 18, 11], [13, 15, 8], [9, 20, 3]]
data5

[[10, 18, 11], [13, 15, 8], [9, 20, 3]]

In [136]:
df11= pd.DataFrame(data5)
df11

    0   1   2
0  10  18  11
1  13  15   8
2   9  20   3

In [137]:
df11.describe()

               0          1          2
count   3.000000   3.000000   3.000000
mean   10.666667  17.666667   7.333333
std     2.081666   2.516611   4.041452
min     9.000000  15.000000   3.000000
25%     9.500000  16.500000   5.500000
50%    10.000000  18.000000   8.000000
75%    11.500000  19.000000   9.500000
max    13.000000  20.000000  11.000000

In [3]:
import pandas as pd

In [138]:
data12=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes vinay\\iris.csv",header=None,names=['sl','sw','pl','pw','species'])

In [139]:
data12

      sl   sw   pl   pw         species
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [141]:
data12.describe()

               sl          sw          pl          pw
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [142]:
data12.loc[data11['pw']==0.100000]

     sl   sw   pl   pw      species
9   4.9  3.1  1.5  0.1  Iris-setosa
12  4.8  3.0  1.4  0.1  Iris-setosa
13  4.3  3.0  1.1  0.1  Iris-setosa
32  5.2  4.1  1.5  0.1  Iris-setosa
34  4.9  3.1  1.5  0.1  Iris-setosa
37  4.9  3.1  1.5  0.1  Iris-setosa

## 30 Aug 2022

In [5]:
import pandas as pd

In [30]:
wether=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_data1.csv")

In [31]:
wether

          day  temperature  windspeed  event
0  01-01-2017            0          6   Rain
1  01-02-2017       -99999          7  Sunny
2  01-03-2017           28     -99999   Snow
3  01-04-2017       -99999          7      0
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [32]:
wether.shape

(7, 4)

In [33]:
wether.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          7 non-null      object
 1   temperature  7 non-null      int64
 2   windspeed    7 non-null      int64
 3   event        7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [34]:
wether

          day  temperature  windspeed  event
0  01-01-2017            0          6   Rain
1  01-02-2017       -99999          7  Sunny
2  01-03-2017           28     -99999   Snow
3  01-04-2017       -99999          7      0
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [38]:
wether.replace({'temperature':[0,-99999],'windspeed':-99999},10,inplace=True)
wether

          day  temperature  windspeed  event
0  01-01-2017           10          6   Rain
1  01-02-2017           10          7  Sunny
2  01-03-2017           28         10   Snow
3  01-04-2017           10          7    NaN
4  01-05-2017           32         10   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5    NaN

In [36]:
import numpy as np

In [37]:
wether.replace({'event':'0'},np.nan,inplace=True)
wether

          day  temperature  windspeed  event
0  01-01-2017           10          6   Rain
1  01-02-2017           10          7  Sunny
2  01-03-2017           28         10   Snow
3  01-04-2017           10          7    NaN
4  01-05-2017           32         10   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5    NaN

In [39]:
x1=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_data1.csv")
x1

          day  temperature  windspeed  event
0  01-01-2017            0          6   Rain
1  01-02-2017       -99999          7  Sunny
2  01-03-2017           28     -99999   Snow
3  01-04-2017       -99999          7      0
4  01-05-2017           32     -99999   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [42]:
x1.replace({'temperature':{-99999:10,0:11},'windspeed':{-99999:12}},inplace=True)
x1

          day  temperature  windspeed  event
0  01-01-2017           11          6   Rain
1  01-02-2017           10          7  Sunny
2  01-03-2017           28         12   Snow
3  01-04-2017           10          7      0
4  01-05-2017           32         12   Rain
5  01-06-2017           31          2  Sunny
6  01-06-2017           34          5      0

In [45]:
x2=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_data2.csv")
x2

        day  temperature  windspeed  event
0  01-01-17          0.0        6.0   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17         28.0        NaN   Snow
3  01-04-17          NaN        7.0      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [48]:
x2.fillna({'temperature':30},inplace=False)
x2

        day  temperature  windspeed  event
0  01-01-17          0.0        6.0   Rain
1  01-02-17         30.0        7.0  Sunny
2  01-03-17         28.0        NaN   Snow
3  01-04-17         30.0        7.0      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [49]:
x2['windspeed'].count()

5

In [51]:
x2['windspeed'].min()

2.0

In [52]:
x2['windspeed'].max()

7.0

In [53]:
x2['windspeed'].mean() # takes only non nan values

5.4

In [54]:
x2['windspeed'].median()

6.0

In [55]:
x2['event'].mode()

0        0
1     Rain
2    Sunny
Name: event, dtype: object

In [56]:
pd.Series(['a','a','b']).mode()

0    a
dtype: object

In [57]:
x2['windspeed']

0    6.0
1    7.0
2    NaN
3    7.0
4    NaN
5    2.0
6    5.0
Name: windspeed, dtype: float64

In [ ]:
# replace the nan with mean of windspeed. in the windspeed column

# if the data contain a outliner then try to fill the unnassary values with median, else fill with mean

In [58]:
dubli

        day  temperature  windspeed  event
0  01-01-17          0.0        6.0   Rain
1  01-02-17         30.0        7.0  Sunny
2  01-03-17         28.0        5.4   Snow
3  01-04-17         30.0        7.0      0
4  01-05-17         32.0        5.4   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [59]:
x2

        day  temperature  windspeed  event
0  01-01-17          0.0        6.0   Rain
1  01-02-17         30.0        7.0  Sunny
2  01-03-17         28.0        NaN   Snow
3  01-04-17         30.0        7.0      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [60]:
# ffill and bfill

In [62]:
k=x2.fillna(method='ffill')
k

        day  temperature  windspeed  event
0  01-01-17          0.0        6.0   Rain
1  01-02-17         30.0        7.0  Sunny
2  01-03-17         28.0        7.0   Snow
3  01-04-17         30.0        7.0      0
4  01-05-17         32.0        7.0   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [64]:
l=x2.fillna(method='bfill')
l

        day  temperature  windspeed  event
0  01-01-17          0.0        6.0   Rain
1  01-02-17         30.0        7.0  Sunny
2  01-03-17         28.0        7.0   Snow
3  01-04-17         30.0        7.0      0
4  01-05-17         32.0        2.0   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [66]:
x3=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_data3.csv")
x3

        day  temperature  windspeed  event
0  01-01-17          0.0        NaN   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17          NaN        NaN   Snow
3  01-04-17          NaN        NaN      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [67]:
r=x3.fillna(method='bfill')
r

        day  temperature  windspeed  event
0  01-01-17          0.0        7.0   Rain
1  01-02-17         32.0        7.0  Sunny
2  01-03-17         32.0        2.0   Snow
3  01-04-17         32.0        2.0      0
4  01-05-17         32.0        2.0   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [70]:
r=x3.fillna(method='bfill',limit=2)
r

        day  temperature  windspeed  event
0  01-01-17          0.0        7.0   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17         32.0        NaN   Snow
3  01-04-17         32.0        2.0      0
4  01-05-17         32.0        2.0   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [68]:
o=x3.fillna(method='ffill')
o

        day  temperature  windspeed  event
0  01-01-17          0.0        NaN   Rain
1  01-02-17          0.0        7.0  Sunny
2  01-03-17          0.0        7.0   Snow
3  01-04-17          0.0        7.0      0
4  01-05-17         32.0        7.0   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [69]:
o=x3.fillna(method='ffill',limit=1)
o

        day  temperature  windspeed  event
0  01-01-17          0.0        NaN   Rain
1  01-02-17          0.0        7.0  Sunny
2  01-03-17          NaN        7.0   Snow
3  01-04-17          NaN        NaN      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [71]:
x3

        day  temperature  windspeed  event
0  01-01-17          0.0        NaN   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17          NaN        NaN   Snow
3  01-04-17          NaN        NaN      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [73]:
v=x3.fillna(method='bfill',axis=1,limit=1)
v

        day temperature windspeed  event
0  01-01-17         0.0      Rain   Rain
1  01-02-17         7.0       7.0  Sunny
2  01-03-17         NaN      Snow   Snow
3  01-04-17         NaN         0      0
4  01-05-17        32.0      Rain   Rain
5  01-06-17        31.0       2.0  Sunny
6  01-06-17        34.0       5.0      0

In [74]:
v=x3.fillna(method='bfill',axis=1,limit=2)
v

        day temperature windspeed  event
0  01-01-17         0.0      Rain   Rain
1  01-02-17         7.0       7.0  Sunny
2  01-03-17        Snow      Snow   Snow
3  01-04-17           0         0      0
4  01-05-17        32.0      Rain   Rain
5  01-06-17        31.0       2.0  Sunny
6  01-06-17        34.0       5.0      0

In [75]:
x3

        day  temperature  windspeed  event
0  01-01-17          0.0        NaN   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17          NaN        NaN   Snow
3  01-04-17          NaN        NaN      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [77]:
m=x3.fillna(method='ffill',axis=1,limit=1)
m

        day temperature windspeed  event
0  01-01-17         0.0       0.0   Rain
1  01-02-17    01-02-17       7.0  Sunny
2  01-03-17    01-03-17       NaN   Snow
3  01-04-17    01-04-17       NaN      0
4  01-05-17        32.0      32.0   Rain
5  01-06-17        31.0       2.0  Sunny
6  01-06-17        34.0       5.0      0

In [78]:
m=x3.fillna(method='ffill',axis=1)
m

        day temperature windspeed  event
0  01-01-17         0.0       0.0   Rain
1  01-02-17    01-02-17       7.0  Sunny
2  01-03-17    01-03-17  01-03-17   Snow
3  01-04-17    01-04-17  01-04-17      0
4  01-05-17        32.0      32.0   Rain
5  01-06-17        31.0       2.0  Sunny
6  01-06-17        34.0       5.0      0

## 01 Sep 2022

In [3]:
import pandas as pd

In [ ]:
# dropna --->Remove missing values.

In [3]:
import pandas as pd
import numpy as np

In [20]:
x1=pd.DataFrame({'name':['a',np.nan,'b','c','d'],'age':[22,33,66,44,55],'gender':['m','f','m','f','m']})
x1

  name  age gender
0    a   22      m
1  NaN   33      f
2    b   66      m
3    c   44      f
4    d   55      m

In [21]:
x1.dropna()

  name  age gender
0    a   22      m
2    b   66      m
3    c   44      f
4    d   55      m

In [24]:
x2=pd.DataFrame({'name':['a',np.nan,'b','c','d'],'age':[22,np.nan,66,44,55],'gender':['m',np.nan,'m','f','m']})
x2

  name   age gender
0    a  22.0      m
1  NaN   NaN    NaN
2    b  66.0      m
3    c  44.0      f
4    d  55.0      m

In [25]:
x2.dropna()

  name   age gender
0    a  22.0      m
2    b  66.0      m
3    c  44.0      f
4    d  55.0      m

In [26]:
x2

  name   age gender
0    a  22.0      m
1  NaN   NaN    NaN
2    b  66.0      m
3    c  44.0      f
4    d  55.0      m

In [ ]:
# pd.dropna(how=all/any)

In [28]:
x2.dropna(how='any')

  name   age gender
0    a  22.0      m
2    b  66.0      m
3    c  44.0      f
4    d  55.0      m

In [29]:
x2

  name   age gender
0    a  22.0      m
1  NaN   NaN    NaN
2    b  66.0      m
3    c  44.0      f
4    d  55.0      m

In [30]:
x2.dropna(how='all')

  name   age gender
0    a  22.0      m
2    b  66.0      m
3    c  44.0      f
4    d  55.0      m

In [63]:
x3=pd.DataFrame({'name':['a',np.nan,'b',np.nan,'d'],'age':[22,np.nan,66,44,55],'gender':['m',np.nan,'m','f','m']})
x3

  name   age gender
0    a  22.0      m
1  NaN   NaN    NaN
2    b  66.0      m
3  NaN  44.0      f
4    d  55.0      m

In [64]:
x3.dropna(how='any')

  name   age gender
0    a  22.0      m
2    b  66.0      m
4    d  55.0      m

In [34]:
x3.dropna(how='all')

  name   age gender
0    a  22.0      m
2    b  66.0      m
3  NaN  44.0      f
4    d  55.0      m

In [ ]:
# pd.dropna(thresh) ---> thresh=Require that many non-NA values.

In [36]:
x4=pd.DataFrame({'name':['a',np.nan,'b',np.nan,np.nan],'age':[22,np.nan,66,44,np.nan],'gender':['m',np.nan,'m','f','m']})
x4

  name   age gender
0    a  22.0      m
1  NaN   NaN    NaN
2    b  66.0      m
3  NaN  44.0      f
4  NaN   NaN      m

In [37]:
join

  name   age gender
0    a  22.0      m
2    b  66.0      m
3  NaN  44.0      f
4  NaN   NaN      m

In [38]:
x4.dropna(thresh=2)

  name   age gender
0    a  22.0      m
2    b  66.0      m
3  NaN  44.0      f

In [39]:
x4.dropna(thresh=3)

  name   age gender
0    a  22.0      m
2    b  66.0      m

In [ ]:
# how to access the multipul sheets in excel.

In [44]:
y=pd.read_excel("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\excel sheet.xlsx")
y

   Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3
0          35          65          63         963
1         963         963         852          96
2          96          63          63          32
3          63          63          63         963

In [49]:
y=pd.read_excel("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\excel sheet.xlsx",'Sheet1')
y

   Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3
0          35          65          63         963
1         963         963         852          96
2          96          63          63          32
3          63          63          63         963

In [50]:
y=pd.read_excel("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\excel sheet.xlsx",'Sheet2')
y

   Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0         NaN         NaN         NaN         NaN         NaN         NaN
1         NaN       752.0    985623.0     96523.0      5623.0      6523.0
2         NaN      5623.0      9562.0    845612.0    985620.0         NaN
3         NaN     95623.0      5623.0      6523.0        52.0      5623.0
4         NaN       528.0      9563.0        52.0      5623.0      9562.0

In [ ]:
# How to save back the DataFrame into Excel

In [54]:
y.to_excel("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\excel sheet3.xlsx")

In [ ]:
# groupby ---> 
'''A groupby operation involves some combination of
splitting the object, applying a function, and combining the results.
This can be used to group large amounts of data and compute operations
on these groups.'''

In [55]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [56]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [22]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
data["Sex"].unique()

array(['male', 'female'], dtype=object)

In [66]:
data.groupby("Sex")

In [24]:
g=data.groupby("Sex")
g

In [9]:
g.ngroups

2

In [10]:
g.groups

{'female': [1, 2, 3, 8, 9, 10, 11, 14, 15, 18, 19, 22, 24, 25, 28, 31, 32, 38, 39, 40, 41, 43, 44, 47, 49, 52, 53, 56, 58, 61, 66, 68, 71, 79, 82, 84, 85, 88, 98, 100, 106, 109, 111, 113, 114, 119, 123, 128, 132, 133, 136, 140, 141, 142, 147, 151, 156, 161, 166, 167, 172, 177, 180, 184, 186, 190, 192, 194, 195, 198, 199, 205, 208, 211, 215, 216, 218, 229, 230, 233, 235, 237, 240, 241, 246, 247, 251, 254, 255, 256, 257, 258, 259, 264, 268, 269, 272, 274, 275, 276, ...], 'male': [0, 4, 5, 6, 7, 12, 13, 16, 17, 20, 21, 23, 26, 27, 29, 30, 33, 34, 35, 36, 37, 42, 45, 46, 48, 50, 51, 54, 55, 57, 59, 60, 62, 63, 64, 65, 67, 69, 70, 72, 73, 74, 75, 76, 77, 78, 80, 81, 83, 86, 87, 89, 90, 91, 92, 93, 94, 95, 96, 97, 99, 101, 102, 103, 104, 105, 107, 108, 110, 112, 115, 116, 117, 118, 120, 121, 122, 124, 125, 126, 127, 129, 130, 131, 134, 135, 137, 138, 139, 143, 144, 145, 146, 148, 149, 150, 152, 153, 154, 155, ...]}

In [11]:
g.get_group("male")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
g.get_group("female")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [13]:
for x,y in g:
    print(x)
    print(y)
    print("-----------------------------------------")

female
     PassengerId  Survived  Pclass  \
1              2         1       1
2              3         1       3
3              4         1       1
8              9         1       3
9             10         1       2
..           ...       ...     ...
880          881         1       2
882          883         0       3
885          886         0       3
887          888         1       1
888          889         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
882      0              7552  10.5167   NaN        S
885      5            382652  29.1250   NaN        Q
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S

[314 rows x 12 columns]
-----------------------------------------
male
     PassengerId  Survived  Pclass                            Name   Sex  \
0              1         0       3         Braund, Mr. Owen Harris  male
4              5         0       3        Allen, Mr. William Henry  male
5              6         0       3                Moran, Mr. James  male
6              7         0       1         McCarthy, Mr. Timothy J  male
7              8         0       3  Palsson, Master. Gosta Leonard  male
..           ...       ...     ...                             ...   ...
883          884         0       2   Banfield, Mr. Frederick James  male
884          885         0       3          Sutehall, Mr. Henry Jr  male
886          887         0       2           Montvila, Rev. Juozas  male
889          890         1       1           Behr, Mr. Karl Howell  male
890          891         0       3             Dooley, Mr. Patrick  male

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    22.0      1      0         A/5 21171   7.2500   NaN        S
4    35.0      0      0            373450   8.0500   NaN        S
5     NaN      0      0            330877   8.4583   NaN        Q
6    54.0      0      0             17463  51.8625   E46        S
7     2.0      3      1            349909  21.0750   NaN        S
..    ...    ...    ...               ...      ...   ...      ...
883  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
886  27.0      0      0            211536  13.0000   NaN        S
889  26.0      0      0            111369  30.0000  C148        C
890  32.0      0      0            370376   7.7500   NaN        Q

[577 rows x 12 columns]
-----------------------------------------

In [14]:
g.count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [25]:
g.get_group("male").count()

PassengerId    577
Survived       577
Pclass         577
Name           577
Sex            577
Age            453
SibSp          577
Parch          577
Ticket         577
Fare           577
Cabin          107
Embarked       577
dtype: int64

In [67]:
g.get_group("male")["Age"]

0      22.0
4      35.0
5       NaN
6      54.0
7       2.0
       ...
883    28.0
884    25.0
886    27.0
889    26.0
890    32.0
Name: Age, Length: 577, dtype: float64

In [15]:
g.get_group("male")["Age"].mean()

30.72664459161148

In [16]:
g.get_group("female")["Age"].mean()

27.915708812260537

In [17]:
g.mean()["Age"]

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [18]:
g.get_group("male")["Age"].min()

0.42

In [19]:
g.get_group("male")["Age"].max()

80.0

In [20]:
g["Age"].min()

Sex
female    0.75
male      0.42
Name: Age, dtype: float64

In [21]:
g["Age"].max()

Sex
female    63.0
male      80.0
Name: Age, dtype: float64

In [22]:
g.get_group("male")["Age"].agg(["count","min","mean","std"])

count    453.000000
min        0.420000
mean      30.726645
std       14.678201
Name: Age, dtype: float64

In [4]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
x=data.groupby('Sex')
x

In [13]:
x['Age'].min()

Sex
female    0.75
male      0.42
Name: Age, dtype: float64

In [14]:
x['Age'].max()

Sex
female    63.0
male      80.0
Name: Age, dtype: float64

In [30]:
y=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\iris.csv",header=None,names=['sl','sw','pl','pw','species'])
y

      sl   sw   pl   pw         species
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [4]:
x=y.groupby('species')

In [5]:
x.ngroups

3

In [6]:
x['species'].unique()

species
Iris-setosa            [Iris-setosa]
Iris-versicolor    [Iris-versicolor]
Iris-virginica      [Iris-virginica]
Name: species, dtype: object

In [7]:
y['species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [8]:
x.groups

{'Iris-setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'Iris-versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'Iris-virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [9]:
x.get_group('Iris-setosa').mean()

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_5456\1553152637.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.get_group('Iris-setosa').mean()

sl    5.006
sw    3.418
pl    1.464
pw    0.244
dtype: float64

In [10]:
x.mean()

                    sl     sw     pl     pw
species
Iris-setosa      5.006  3.418  1.464  0.244
Iris-versicolor  5.936  2.770  4.260  1.326
Iris-virginica   6.588  2.974  5.552  2.026

In [11]:
x['sl'].mean()

species
Iris-setosa        5.006
Iris-versicolor    5.936
Iris-virginica     6.588
Name: sl, dtype: float64

In [12]:
x['sl'].agg(['count','min','max','std','mean'])

                 count  min  max       std   mean
species
Iris-setosa         50  4.3  5.8  0.352490  5.006
Iris-versicolor     50  4.9  7.0  0.516171  5.936
Iris-virginica      50  4.9  7.9  0.635880  6.588

In [ ]:
# value_counts()
'''Return a Series containing counts of unique values.

The resulting object will be in descending order so that the first element is the most frequently-occurring element.
Excludes NA values by default.'''

In [3]:
import pandas as pd
import numpy as np
index = pd.Index([3, 1, 2, 3, 4, np.nan])
index.value_counts()

3.0    2
1.0    1
2.0    1
4.0    1
dtype: int64

In [31]:
y["species"].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: species, dtype: int64

In [32]:
y.shape

(150, 5)

In [33]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sl       150 non-null    float64
 1   sw       150 non-null    float64
 2   pl       150 non-null    float64
 3   pw       150 non-null    float64
 4   species  150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
# Converting the data type. (astype())

In [34]:
y["sl"]=y["sl"].astype(int)

In [35]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sl       150 non-null    int32
 1   sw       150 non-null    float64
 2   pl       150 non-null    float64
 3   pw       150 non-null    float64
 4   species  150 non-null    object
dtypes: float64(3), int32(1), object(1)
memory usage: 5.4+ KB

In [36]:
y=y.astype({"sw":int,"pl":complex})

In [37]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sl       150 non-null    int32
 1   sw       150 non-null    int32
 2   pl       150 non-null    complex128
 3   pw       150 non-null    float64
 4   species  150 non-null    object
dtypes: complex128(1), float64(1), int32(2), object(1)
memory usage: 6.0+ KB

In [38]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [40]:
data["Survived"]=data["Survived"].astype(object)

In [41]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 83.7+ KB

In [42]:
data["Age"].isnull().sum()

177

In [43]:
data.fillna(0,inplace=True)

In [44]:
data["Age"].isnull().sum()

0

In [45]:
data=data.astype({"Pclass":"category","Age":int})

In [46]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    category
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: category(1), float64(1), int32(1), int64(4), object(5)
memory usage: 74.2+ KB

In [61]:
# duplicated()
'''Return boolean Series denoting duplicate rows.

Considering certain columns is optional.

subset: column label or sequence of labels, optional
Only consider certain columns for identifying duplicates, by default use all of the columns.

keep: {first, last, False}, default first
Determines which duplicates (if any) to mark.

first : Mark duplicates as True except for the first occurrence.

last : Mark duplicates as True except for the last occurrence.

False : Mark all duplicates as True.'''

'Return boolean Series denoting duplicate rows.\n\nConsidering certain columns is optional.\n'

In [47]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [48]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [49]:
df.duplicated().sum()

1

In [50]:
df.duplicated(keep='last')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [51]:
df.duplicated(keep=False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [54]:
df.duplicated(subset=['brand'])

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [ ]:
#.drop_duplicates ()
'''Return DataFrame with duplicate rows removed.

Considering certain columns is optional. Indexes, including time indexes are ignored.

subsetcolumn label or sequence of labels, optional
Only consider certain columns for identifying duplicates, by default use all of the columns.

keep{first, last, False}, default first
Determines which duplicates (if any) to keep. - first : Drop duplicates except for the first occurrence. - last : Drop duplicates except for the last occurrence. - False : Drop all duplicates.

inplacebool, default False
Whether to drop duplicates in place or to return a copy.

ignore_indexbool, default False
If True, the resulting axis will be labeled 0, 1, , n - 1.
'''

In [55]:
df.drop
_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [56]:
df.drop_duplicates(subset='brand')

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

In [57]:
df.drop_duplicates(subset='rating')

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [58]:
df.drop_duplicates(keep='first')

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [59]:
df.drop_duplicates(keep='last')

     brand style  rating
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [60]:
df.drop_duplicates(keep=False)

     brand style  rating
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [ ]:
# isnull()

In [70]:
z=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_data3.csv")
z

        day  temperature  windspeed  event
0  01-01-17          0.0        NaN   Rain
1  01-02-17          NaN        7.0  Sunny
2  01-03-17          NaN        NaN   Snow
3  01-04-17          NaN        NaN      0
4  01-05-17         32.0        NaN   Rain
5  01-06-17         31.0        2.0  Sunny
6  01-06-17         34.0        5.0      0

In [ ]:
# To know number of null values present in a DataFrame (.isnull().sum()).

In [26]:
z.isnull()

     day  temperature  windspeed  event
0  False        False       True  False
1  False         True      False  False
2  False         True       True  False
3  False         True       True  False
4  False        False       True  False
5  False        False      False  False
6  False        False      False  False

In [25]:
z.isnull().sum()

day            0
temperature    3
windspeed      4
event          0
dtype: int64

In [71]:
(~z.isnull()).sum() # to print the number of non-nul values.

day            7
temperature    4
windspeed      3
event          7
dtype: int64

In [ ]:
# To know the number of nun-null valus present in a given Data Frame (~data.isnull()).sum().

In [27]:
(~data.isnull()).sum()--->titanic data.

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

## 02 Sep 2022

In [1]:
# Concatenate--> Joining two Dataframes.
'''Concatenate pandas objects along a particular axis with optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis, which may be useful if the labels are the same (or overlapping) on the passed axis number.'''

In [3]:
import pandas as pd

In [ ]:
# Combining Series

In [16]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [17]:
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [18]:
pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [20]:
s3=pd.concat([s1, s2], keys=['s1', 's2'],
          names=['Series name', 'Row ID'])
s3

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [24]:
print(s3.loc['s1'])
print('-------------')
print(s3.loc['s2'])

Row ID
0    a
1    b
dtype: object
-------------
Row ID
0    c
1    d
dtype: object

In [ ]:
# Combining DataFrames

In [ ]:
# Row wise concatination

In [5]:
df1=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[34,45,21,34],"winds":[12,43,56,78]})
df1

  cities  temp  winds
0    hyd    34     12
1    bnc    45     43
2    ngp    21     56
3    che    34     78

In [6]:
df2=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[45,65,21,54]})
df2

  cities  temp
0    hyd    45
1    bnc    65
2    ngp    21
3    che    54

In [7]:
df3=pd.concat([df1,df2],ignore_index=True)
df3

  cities  temp  winds
0    hyd    34   12.0
1    bnc    45   43.0
2    ngp    21   56.0
3    che    34   78.0
4    hyd    45    NaN
5    bnc    65    NaN
6    ngp    21    NaN
7    che    54    NaN

In [ ]:
# Column wise concatination.

In [9]:
df4=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[34,45,21,34]},index=[1,2,3,4])
df4

  cities  temp
1    hyd    34
2    bnc    45
3    ngp    21
4    che    34

In [10]:
df5=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[45,65,21,54]},index=[2,1,3,5])
df5

  cities  temp
2    hyd    45
1    bnc    65
3    ngp    21
5    che    54

In [11]:
pd.concat([df4,df5],axis=1)

  cities  temp cities  temp
1    hyd  34.0    bnc  65.0
2    bnc  45.0    hyd  45.0
3    ngp  21.0    ngp  21.0
4    che  34.0    NaN   NaN
5    NaN   NaN    che  54.0

In [ ]:
# if you want to get back your dataframes nce after combining,
#use keys and also donot give indexing
#( and dont use ignore_index=True when we use keys)

In [12]:
df1=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[34,45,21,34]})
df2=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[45,65,21,54]})

In [13]:
df3=pd.concat([df1,df2],keys=["df1","df2"])
df3

      cities  temp
df1 0    hyd    34
    1    bnc    45
    2    ngp    21
    3    che    34
df2 0    hyd    45
    1    bnc    65
    2    ngp    21
    3    che    54

In [ ]:
# to get back your dataframes

In [14]:
df3.loc["df1"]

  cities  temp
0    hyd    34
1    bnc    45
2    ngp    21
3    che    34

In [15]:
df3.loc["df2"]

  cities  temp
0    hyd    45
1    bnc    65
2    ngp    21
3    che    54

In [25]:
# Merging =--> Merge DataFrame or named Series objects with a database-style join.

In [32]:
df1=pd.DataFrame({"cities":["hyd","bnc","ngp","che"],"temp":[34,45,21,34]})
df1

  cities  temp
0    hyd    34
1    bnc    45
2    ngp    21
3    che    34

In [33]:
df2=pd.DataFrame({"cities":["hyd","bnc","ngp","delhi"],"windspeed":[24,55,91,24]})
df2

  cities  windspeed
0    hyd         24
1    bnc         55
2    ngp         91
3  delhi         24

In [ ]:
# on---->
'''Column or index level names to join on.
These must be found in both DataFrames.
If on is None and not merging on indexes
then this defaults to the intersection of the columns in both DataFrames.'''

In [36]:
pd.merge(df1,df2,on="cities")

  cities  temp  windspeed
0    hyd    34         24
1    bnc    45         55
2    ngp    21         91

In [ ]:
#[ (left)->che [inner->(hyd,bnc,ngp)] (right)->delhi]
#outer(che,hyd,bnc,ngp,delhi)

In [ ]:
#how --> 
'''how{left, right, outer, inner, cross}, default inner
Type of merge to be performed.

left: use only keys from left frame, similar to a SQL left outer join;
preserve key order.

right: use only keys from right frame, similar to a SQL right outer join; 
preserve key order.

outer: use union of keys from both frames, similar to a SQL full outer join;
sort keys lexicographically.

inner: use intersection of keys from both frames, similar to a SQL inner join;
preserve the order of the left keys.

cross: creates the cartesian product from both frames, 
preserves the order of the left keys.'''

In [37]:
pd.merge(df1,df2,on="cities",how="inner")

  cities  temp  windspeed _merge
0    hyd    34         24   both
1    bnc    45         55   both
2    ngp    21         91   both

In [ ]:
# indicator---> 
'''If True, adds a column to the output DataFrame called _merge with
information on the source of each row. 
The column can be given a different name by providing a string argument.
The column will have a Categorical type with the value of left_only 
for observations whose merge key only appears in the left DataFrame,
right_only for observations whose merge key only appears in the right 
DataFrame, and both if the observations merge key is found in both 
DataFrames.

'''

In [38]:
pd.merge(df1,df2,on="cities",how="inner",indicator=True)

  cities  temp  windspeed _merge
0    hyd    34         24   both
1    bnc    45         55   both
2    ngp    21         91   both

In [39]:
pd.merge(df1,df2,on="cities",how="outer",indicator=True)

  cities  temp  windspeed      _merge
0    hyd  34.0       24.0        both
1    bnc  45.0       55.0        both
2    ngp  21.0       91.0        both
3    che  34.0        NaN   left_only
4  delhi   NaN       24.0  right_only

In [40]:
pd.merge(df1,df2,on="cities",how="left",indicator=True)

  cities  temp  windspeed     _merge
0    hyd    34       24.0       both
1    bnc    45       55.0       both
2    ngp    21       91.0       both
3    che    34        NaN  left_only

In [41]:
pd.merge(df1,df2,on="cities",how="right",indicator=True)

  cities  temp  windspeed      _merge
0    hyd  34.0         24        both
1    bnc  45.0         55        both
2    ngp  21.0         91        both
3  delhi   NaN         24  right_only

In [43]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df1

  left
0  foo
1  bar

In [44]:
df2 = pd.DataFrame({'right': [7, 8]})
df2

   right
0      7
1      8

In [45]:
df1.merge(df2, how='cross')

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

In [46]:
# Time and Date

In [47]:
# date_range()

In [49]:
pd.date_range(start='2018-01-01', end='2018-01-08')

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

In [50]:
pd.date_range(start='2018-01-01', periods=8)

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

In [51]:
pd.date_range(end='2018-01-01', periods=8)

DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
               '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
              dtype='datetime64[ns]', freq='D')

In [52]:
pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)

DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
               '2018-04-27 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [54]:
pd.date_range(start='2018-04-24', end='2018-04-28', periods=3)

DatetimeIndex(['2018-04-24', '2018-04-26', '2018-04-28'], dtype='datetime64[ns]', freq=None)

In [56]:
pd.date_range(start='1/1/2018', periods=5, freq='m')

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')

In [60]:
pd.date_range('1/1/2018', periods=5, freq='3M')

DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
               '2019-01-31'],
              dtype='datetime64[ns]', freq='3M')

In [57]:
pd.date_range(start='1/1/2018', periods=5, freq='y')

DatetimeIndex(['2018-12-31', '2019-12-31', '2020-12-31', '2021-12-31',
               '2022-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [58]:
pd.date_range(start='1/1/2018', periods=5, freq='d')

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
#Specify tz to set the timezone. (tz=)

In [64]:
pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')

DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
               '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
               '2018-01-05 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Tokyo]', freq='D')

In [ ]:
# inclusive controls whether to include start and end that are on the boundary. 
#The default, both, includes boundary points on either end.

In [65]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive="both")

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')

In [ ]:
# Use inclusive='left' to exclude end if it falls on the boundary.

In [66]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='left')

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'], dtype='datetime64[ns]', freq='D')

In [ ]:
# Use inclusive='right' to exclude start if it falls on the boundary,
#and similarly inclusive='neither' will exclude both start and end.

In [67]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='right')

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')

In [69]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='neither')

DatetimeIndex(['2017-01-02', '2017-01-03'], dtype='datetime64[ns]', freq='D')

In [71]:
data1=pd.DataFrame(pd.date_range("1996-01-01",periods=12,freq="m"),columns=["Date"])
data1

         Date
0  1996-01-31
1  1996-02-29
2  1996-03-31
3  1996-04-30
4  1996-05-31
5  1996-06-30
6  1996-07-31
7  1996-08-31
8  1996-09-30
9  1996-10-31
10 1996-11-30
11 1996-12-31

In [ ]:
# to get all the monts, year , days use  .dt

In [72]:
data1["Date"].dt.month

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
Name: Date, dtype: int64

In [73]:
data1["Date"].dt.year

0     1996
1     1996
2     1996
3     1996
4     1996
5     1996
6     1996
7     1996
8     1996
9     1996
10    1996
11    1996
Name: Date, dtype: int64

In [74]:
data1["Date"].dt.day

0     31
1     29
2     31
3     30
4     31
5     30
6     31
7     31
8     30
9     31
10    30
11    31
Name: Date, dtype: int64

In [ ]:
# to get the present date and time use timestamp

In [91]:
pd.Timestamp.now()

Timestamp('2022-09-02 17:20:18.053667')

In [ ]:
# to calculate the DOB

In [92]:
pd.Timestamp.now().year-int(input("type you dob"))

type you dob1999

23

In [93]:
int(str(pd.Timestamp.now())[0:4])- int(input("type you dob"))

type you dob1999

23

In [75]:
# converting the object data type into datetime datatime

In [76]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_by_cities.csv")
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [77]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     object
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
dtypes: int64(2), object(3)
memory usage: 608.0+ bytes

In [78]:
data["day"]=pd.to_datetime(data["day"])

In [79]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     datetime64[ns]
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 608.0+ bytes

In [80]:
data["day"].dt.day

0     1
1     2
2     3
3     4
4     1
5     2
6     3
7     4
8     1
9     2
10    3
11    4
Name: day, dtype: int64

In [82]:
data["day"].dt.month

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
Name: day, dtype: int64

In [83]:
data["day"].dt.year

0     2017
1     2017
2     2017
3     2017
4     2017
5     2017
6     2017
7     2017
8     2017
9     2017
10    2017
11    2017
Name: day, dtype: int64

In [84]:
# to conver a colume in a index use (.set_index) 
# and if you want to remove and reset use(.reset_index)

In [85]:
data

          day      city  temperature  windspeed   event
0  2017-01-01  new york           32          6    Rain
1  2017-01-02  new york           36          7   Sunny
2  2017-01-03  new york           28         12    Snow
3  2017-01-04  new york           33          7   Sunny
4  2017-01-01    mumbai           90          5   Sunny
5  2017-01-02    mumbai           85         12     Fog
6  2017-01-03    mumbai           87         15     Fog
7  2017-01-04    mumbai           92          5    Rain
8  2017-01-01     paris           45         20   Sunny
9  2017-01-02     paris           50         13  Cloudy
10 2017-01-03     paris           54          8  Cloudy
11 2017-01-04     paris           42         10  Cloudy

In [86]:
data.set_index("temperature",inplace=True)

In [87]:
data

                   day      city  windspeed   event
temperature
32          2017-01-01  new york          6    Rain
36          2017-01-02  new york          7   Sunny
28          2017-01-03  new york         12    Snow
33          2017-01-04  new york          7   Sunny
90          2017-01-01    mumbai          5   Sunny
85          2017-01-02    mumbai         12     Fog
87          2017-01-03    mumbai         15     Fog
92          2017-01-04    mumbai          5    Rain
45          2017-01-01     paris         20   Sunny
50          2017-01-02     paris         13  Cloudy
54          2017-01-03     paris          8  Cloudy
42          2017-01-04     paris         10  Cloudy

In [88]:
data.index

Int64Index([32, 36, 28, 33, 90, 85, 87, 92, 45, 50, 54, 42], dtype='int64', name='temperature')

In [89]:
data.reset_index(inplace=True)

In [90]:
data

    temperature        day      city  windspeed   event
0            32 2017-01-01  new york          6    Rain
1            36 2017-01-02  new york          7   Sunny
2            28 2017-01-03  new york         12    Snow
3            33 2017-01-04  new york          7   Sunny
4            90 2017-01-01    mumbai          5   Sunny
5            85 2017-01-02    mumbai         12     Fog
6            87 2017-01-03    mumbai         15     Fog
7            92 2017-01-04    mumbai          5    Rain
8            45 2017-01-01     paris         20   Sunny
9            50 2017-01-02     paris         13  Cloudy
10           54 2017-01-03     paris          8  Cloudy
11           42 2017-01-04     paris         10  Cloudy

In [94]:
# String functions in Pandas

In [95]:
client_dictionary = {'name': ['Michael Smith', 'Ana Kors', 'Sean Bill', 'Carl Jonson', 'Bob Evan'], 
                     'grade': [['A', 'A'], ['C'], ['A', 'C', 'B'], [], ['F']], 
                     'age': ['19', '19', '17', '18', '-'],
                     'group': ['class 1', 'class 2', 'class 2', 'class 1', 'class 2'],
                     'suspended': [True, False, True, False, True]
                    }
df = pd.DataFrame(client_dictionary)
df

            name      grade age    group  suspended
0  Michael Smith     [A, A]  19  class 1       True
1       Ana Kors        [C]  19  class 2      False
2      Sean Bill  [A, C, B]  17  class 2       True
3    Carl Jonson         []  18  class 1      False
4       Bob Evan        [F]   -  class 2       True

In [96]:
df.name.str.upper()

0    MICHAEL SMITH
1         ANA KORS
2        SEAN BILL
3      CARL JONSON
4         BOB EVAN
Name: name, dtype: object

In [97]:
df.name.str.lower()

0    michael smith
1         ana kors
2        sean bill
3      carl jonson
4         bob evan
Name: name, dtype: object

In [98]:
df.name.str.isupper()

0    False
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [99]:
df.name.str.upper().str.isupper()

0    True
1    True
2    True
3    True
4    True
Name: name, dtype: bool

In [100]:
df.name.str.islower()

0    False
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [101]:
df.age.str.isnumeric()

0     True
1     True
2     True
3     True
4    False
Name: age, dtype: bool

In [102]:
df.group.str.replace('class ', '')

0    1
1    2
2    2
3    1
4    2
Name: group, dtype: object

In [103]:
df.group.str.replace(r'[a-z]+ ', '')

C:\Users\Gogula Vinay\AppData\Local\Temp\ipykernel_7704\917162232.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df.group.str.replace(r'[a-z]+ ', '')

0    1
1    2
2    2
3    1
4    2
Name: group, dtype: object

In [104]:
df.name.str.split()

0    [Michael, Smith]
1         [Ana, Kors]
2        [Sean, Bill]
3      [Carl, Jonson]
4         [Bob, Evan]
Name: name, dtype: object

In [105]:
df.name.str.split('a')

0    [Mich, el Smith]
1         [An,  Kors]
2        [Se, n Bill]
3      [C, rl Jonson]
4         [Bob Ev, n]
Name: name, dtype: object

In [106]:
df.group.str.contains('1')

0     True
1    False
2    False
3     True
4    False
Name: group, dtype: bool

In [107]:

df.group.str.contains(r'[0-9]')

0    True
1    True
2    True
3    True
4    True
Name: group, dtype: bool

In [108]:
df.name.str.find('s')

0   -1
1    7
2   -1
3    8
4   -1
Name: name, dtype: int64

In [ ]:
#Findall()
'''Findall() similarly to find() will search a string for existing substring but instead of one index, it will return a list of matching substrings. 


Again it is best to see using a real example. Let's search the name column for 'an' substrings.'''

In [109]:
df.name.str.findall('an')

0      []
1      []
2    [an]
3      []
4    [an]
Name: name, dtype: object

In [110]:
import re
df.name.str.findall('an', flags=re.IGNORECASE)

0      []
1    [An]
2    [an]
3      []
4    [an]
Name: name, dtype: object

# 03 Sep 2022

In [9]:
import pandas as pd
import numpy as np

In [10]:
#map() ---> map() applys element wise and only works on a Series.
'''The map() function is used to map values of Series according to input correspondence.

Used for substituting each value in a Series with another value, 
that may be derived from a function, a dict or a Series.'''

'The map() function is used to map values of Series according to input correspondence.\n\nUsed for substituting each value in a Series with another value, \nthat may be derived from a function, a dict or a Series.'

In [11]:
s = pd.Series(['fox', 'cow', np.nan, 'dog'])
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

In [12]:
s.map({'fox': 'cub', 'cow': 'calf'})

0     cub
1    calf
2     NaN
3     NaN
dtype: object

In [13]:
s.map('I am a {}'.format)

0    I am a fox
1    I am a cow
2    I am a nan
3    I am a dog
dtype: object

In [ ]:
#To avoid applying the function to missing values (and keep them as NaN) 
#na_action='ignore' can be used:

In [15]:
s.map('I am a {}'.format, na_action='ignore')

0    I am a fox
1    I am a cow
2           NaN
3    I am a dog
dtype: object

In [17]:
data=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
data['Sex']=data['Sex'].map({'male':0,'female':1})

In [20]:
data['Sex']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [21]:
# apply() ---> Applicable on both series aswell as DataFrame

In [25]:
# Series
x=pd.Series(['a','gh','sdfg','asdfghjk'])
x

0           a
1          gh
2        sdfg
3    asdfghjk
dtype: object

In [26]:
x.apply(len) # it gives the no.of charactor available in each element.

0    1
1    2
2    4
3    8
dtype: int64

In [27]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [28]:
data.fillna(0,inplace=True)

In [29]:
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [30]:
data['Age']=data['Age'].apply(int)

In [31]:
data['Age']

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888     0
889    26
890    32
Name: Age, Length: 891, dtype: int64

In [36]:
def f1(x):
    return x.lower()

In [37]:
data['Name'].apply(f1)

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [38]:
# all the name names are transformed into lower case (User defind function)

In [ ]:
# apply() on DataFrame--> apply() apply's to all to all rows and columns.

In [22]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [23]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [39]:
data[['Age']].apply(min)

Age    0
dtype: int64

In [40]:
data[['Age']].apply(max)

Age    80
dtype: int64

In [41]:
data[['Age']].apply(np.sum)

Age    21191
dtype: int64

In [43]:
data[['Age']].apply(np.mean)

Age    23.783389
dtype: float64

In [46]:
data[['Age','Fare']].apply(min,axis=1)

0       7.250
1      38.000
2       7.925
3      35.000
4       8.050
        ...
886    13.000
887    19.000
888     0.000
889    26.000
890     7.750
Length: 891, dtype: float64

In [47]:
# applymap()---> applyed only on the DataFrames

In [48]:
# if the function need to go element wise in a dataframe we ue applymap()

In [50]:
data[['Age','Fare']].applymap(int)

     Age  Fare
0     22     7
1     38    71
2     26     7
3     35    53
4     35     8
..   ...   ...
886   27    13
887   19    30
888    0    23
889   26    30
890   32     7

[891 rows x 2 columns]

In [51]:
df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [52]:
df.applymap(lambda x: len(str(x)))

   0  1
0  3  4
1  5  5

In [53]:
df_copy = df.copy()
df_copy.iloc[0, 0] = pd.NA
df_copy.applymap(lambda x: len(str(x)), na_action='ignore')

      0  1
0  <NA>  4
1     5  5

In [54]:
df.applymap(lambda x: x**2)

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [55]:
df ** 2

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [56]:
# Pivot

In [57]:
'''
Return reshaped DataFrame organized by given index / column values.
Reshape data (produce a pivot table) based on column values.
Uses unique values from specified index / columns to form axes 
of the resulting DataFrame. 
This function does not support data aggrapplegation,
multiple values will result in a MultiIndex in the columns.
See the User Guide for more on reshaping.'''

'\nReturn reshaped DataFrame organized by given index / column values.\nReshape data (produce a pivot table) based on column values.\nUses unique values from specified index / columns to form axes \nof the resulting DataFrame. \nThis function does not support data aggregation,\nmultiple values will result in a MultiIndex in the columns.\nSee the User Guide for more on reshaping.'

In [2]:
import pandas as pd
#pivot and pivot tabel
#pivot is used to reshape and transform your DF
#pivot table will give transformation and summary on DF
z1=pd.read_csv(r'C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\weather_by_cities.csv')

In [3]:
z1

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [4]:
z1.pivot(index='city',columns='day')

         temperature                            windspeed                    \
day         1/1/2017 1/2/2017 1/3/2017 1/4/2017  1/1/2017 1/2/2017 1/3/2017
city
mumbai            90       85       87       92         5       12       15
new york          32       36       28       33         6        7       12
paris             45       50       54       42        20       13        8

                     event
day      1/4/2017 1/1/2017 1/2/2017 1/3/2017 1/4/2017
city
mumbai          5    Sunny      Fog      Fog     Rain
new york        7     Rain    Sunny     Snow    Sunny
paris          10    Sunny   Cloudy   Cloudy   Cloudy

In [5]:
z1.pivot(index=['city','event'],columns='day',values=['temperature','windspeed'])

                temperature                            windspeed           \
day                1/1/2017 1/2/2017 1/3/2017 1/4/2017  1/1/2017 1/2/2017
city     event
mumbai   Fog            NaN     85.0     87.0      NaN       NaN     12.0
         Rain           NaN      NaN      NaN     92.0       NaN      NaN
         Sunny         90.0      NaN      NaN      NaN       5.0      NaN
new york Rain          32.0      NaN      NaN      NaN       6.0      NaN
         Snow           NaN      NaN     28.0      NaN       NaN      NaN
         Sunny          NaN     36.0      NaN     33.0       NaN      7.0
paris    Cloudy         NaN     50.0     54.0     42.0       NaN     13.0
         Sunny         45.0      NaN      NaN      NaN      20.0      NaN


day             1/3/2017 1/4/2017
city     event
mumbai   Fog        15.0      NaN
         Rain        NaN      5.0
         Sunny       NaN      NaN
new york Rain        NaN      NaN
         Snow       12.0      NaN
         Sunny       NaN      7.0
paris    Cloudy      8.0     10.0
         Sunny       NaN      NaN

In [7]:
import numpy as np
z1.pivot_table(index=['city'],columns='day',values=['temperature','windspeed'],aggfunc={'temperature':np.min,'windspeed':np.max},margins=True)

         temperature                                windspeed           \
day         1/1/2017 1/2/2017 1/3/2017 1/4/2017 All  1/1/2017 1/2/2017
city
mumbai            90       85       87       92  85         5       12
new york          32       36       28       33  28         6        7
paris             45       50       54       42  42        20       13
All               32       36       28       33  28        20       13


day      1/3/2017 1/4/2017 All
city
mumbai         15        5  15
new york       12        7  12
paris           8       10  20
All            15       10  20

In [8]:
z1.pivot_table(index=['city'],columns='day',values=['temperature','windspeed'],aggfunc=[np.mean],margins=True)

                mean                                                       \
         temperature                                            windspeed
day         1/1/2017 1/2/2017   1/3/2017   1/4/2017        All   1/1/2017
city
mumbai     90.000000       85  87.000000  92.000000  88.500000   5.000000
new york   32.000000       36  28.000000  33.000000  32.250000   6.000000
paris      45.000000       50  54.000000  42.000000  47.750000  20.000000
All        55.666667       57  56.333333  55.666667  56.166667  10.333333



day        1/2/2017   1/3/2017   1/4/2017    All
city
mumbai    12.000000  15.000000   5.000000   9.25
new york   7.000000  12.000000   7.000000   8.00
paris     13.000000   8.000000  10.000000  12.75
All       10.666667  11.666667   7.333333  10.00

In [58]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [59]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [60]:
df.pivot(index='foo', columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [61]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [67]:
# You could also assign a list of column names or a list of index names.

In [68]:
df = pd.DataFrame({
       "lev1": [1, 1, 1, 2, 2, 2],
       "lev2": [1, 1, 2, 1, 1, 2],
       "lev3": [1, 2, 1, 2, 1, 2],
       "lev4": [1, 2, 3, 4, 5, 6],
       "values": [0, 1, 2, 3, 4, 5]})
df

   lev1  lev2  lev3  lev4  values
0     1     1     1     1       0
1     1     1     2     2       1
2     1     2     1     3       2
3     2     1     2     4       3
4     2     1     1     5       4
5     2     2     2     6       5

In [69]:
df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")

lev2    1         2
lev3    1    2    1    2
lev1
1     0.0  1.0  2.0  NaN
2     4.0  3.0  NaN  5.0

In [70]:
df.pivot(index=["lev1", "lev2"], columns=["lev3"],values="values")

lev3         1    2
lev1 lev2
1    1     0.0  1.0
     2     2.0  NaN
2    1     4.0  3.0
     2     NaN  5.0

In [71]:
# A ValueError is raised if there are any duplicates.

In [72]:
df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
                   "bar": ['A', 'A', 'B', 'C'],
                   "baz": [1, 2, 3, 4]})
df

   foo bar  baz
0  one   A    1
1  one   A    2
2  two   B    3
3  two   C    4

In [ ]:
# Notice that the first two rows are the same for our index and columns arguments.

In [73]:
df.pivot(index='foo', columns='bar', values='baz')

ValueError: Index contains duplicate entries, cannot reshape

In [77]:
# Pivot-table

In [78]:
'''Create a spreadsheet-style pivot table as a DataFrame.

The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.'''

'Create a spreadsheet-style pivot table as a DataFrame.\n\nThe levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.'

In [79]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [ ]:
# This first example aggregates values by taking the sum.

In [80]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [81]:
# We can also fill missing values using the fill_value parameter.

In [88]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [83]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

In [84]:
'''We can also calculate multiple types of aggregations for any given value column.

'''

'We can also calculate multiple types of aggregations for any given value column.\n\n'

In [85]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': [min, max, np.mean]})
table

                  D   E
               mean max      mean min
A   C
bar large  5.500000   9  7.500000   6
    small  5.500000   9  8.500000   8
foo large  2.000000   5  4.500000   4
    small  2.333333   6  4.333333   2

In [89]:
data1=pd.read_csv("C:\\Users\\Gogula Vinay\\Desktop\\Innomatics labs\\Data Science\\Pandas Class notes by vinay\\weather_by_cities.csv")
data1

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [99]:
data1.pivot_table(index='city',columns='day',values=['temperature','windspeed'],aggfunc=np.min,margins=True)

         temperature                                windspeed           \
day         1/1/2017 1/2/2017 1/3/2017 1/4/2017 All  1/1/2017 1/2/2017
city
mumbai            90       85       87       92  85         5       12
new york          32       36       28       33  28         6        7
paris             45       50       54       42  42        20       13
All               32       36       28       33  28         5        7


day      1/3/2017 1/4/2017 All
city
mumbai         15        5   5
new york       12        7   6
paris           8       10   8
All             8        5   5

In [100]:
# .sort_values

In [101]:
#Sort by the values along either axis.

In [9]:
z1.sort_values('temperature')

         day      city  temperature  windspeed   event
2   1/3/2017  new york           28         12    Snow
0   1/1/2017  new york           32          6    Rain
3   1/4/2017  new york           33          7   Sunny
1   1/2/2017  new york           36          7   Sunny
11  1/4/2017     paris           42         10  Cloudy
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
4   1/1/2017    mumbai           90          5   Sunny
7   1/4/2017    mumbai           92          5    Rain

In [10]:
z1.sort_values('temperature',inplace=True,ascending=False)
z1

         day      city  temperature  windspeed   event
7   1/4/2017    mumbai           92          5    Rain
4   1/1/2017    mumbai           90          5   Sunny
6   1/3/2017    mumbai           87         15     Fog
5   1/2/2017    mumbai           85         12     Fog
10  1/3/2017     paris           54          8  Cloudy
9   1/2/2017     paris           50         13  Cloudy
8   1/1/2017     paris           45         20   Sunny
11  1/4/2017     paris           42         10  Cloudy
1   1/2/2017  new york           36          7   Sunny
3   1/4/2017  new york           33          7   Sunny
0   1/1/2017  new york           32          6    Rain
2   1/3/2017  new york           28         12    Snow

In [102]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [103]:
df.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [104]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [105]:
df.sort_values(by='col1', ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

In [106]:
df.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

In [107]:
df.sort_values(by='col4', key=lambda col: col.str.lower())

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [1]:
import pandas as pd

In [7]:
data=pd.read_csv(r"C:\Users\Gogula Vinay\Desktop\Innomatics labs\Data Science\Pandas Class notes by vinay\pandas titanic practic\titanic.csv",usecols=['PassengerId'])

ValueError: Usecols do not match columns, columns expected but not found: ['PassengerId']